2022-02-13 11:37:36.186606: W tensorflow/core/common_runtime/gpu/gpu_bfc_allocator.cc:39] Overriding allow_growth setting because the TF_FORCE_GPU_ALLOW_GROWTH environment variable is set. Original config value was 0.
2022-02-13 11:37:36.186686: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1510] Created device /job:localhost/replica:0/task:0/device:GPU:0 with 9672 MB memory:  -> device: 0, name: NVIDIA GeForce RTX 2080 Ti, pci bus id: 0000:89:00.0, compute capability: 7.5
2022-02-13 11:37:38.077748: I tensorflow/compiler/mlir/mlir_graph_optimization_pass.cc:185] None of the MLIR Optimization Passes are enabled (registered 2)

starting training with hard coded values..
Batch size: 100
Learning rate: 0.001
Epochs: 800
Model: PFN_base
GPU: 5
Training on 10000 events

Loading data..
time to load data: 0.0058 (s)

X size: (10000, 1086, 5)

train -- val -- test
7000 -- 1500 -- 1500

time to split:   0.00 (m)

Loading models..
Model: "PFN_base"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 1086, 5)]    0                                            
__________________________________________________________________________________________________
t_dist_0 (TimeDistributed)      (None, 1086, 100)    600         input[0][0]                      
__________________________________________________________________________________________________
activation_0 (Activation)       (None, 1086, 100)    0           t_dist_0[0][0]                   
__________________________________________________________________________________________________
t_dist_1 (TimeDistributed)      (None, 1086, 100)    10100       activation_0[0][0]               
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1086, 100)    0           t_dist_1[0][0]                   
__________________________________________________________________________________________________
t_dist_2 (TimeDistributed)      (None, 1086, 128)    12928       activation_1[0][0]               
__________________________________________________________________________________________________
mask (Lambda)                   (None, 1086)         0           input[0][0]                      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 1086, 128)    0           t_dist_2[0][0]                   
__________________________________________________________________________________________________
sum (Dot)                       (None, 128)          0           mask[0][0]                       
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
dense_0 (Dense)                 (None, 100)          12900       sum[0][0]                        
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 100)          0           dense_0[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          10100       activation_3[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 100)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          10100       activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 100)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
output (Dense)                  (None, 1)            101         activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 1)            0           output[0][0]                     
==================================================================================================
Total params: 56,829
Trainable params: 56,829
Non-trainable params: 0
__________________________________________________________________________________________________

Training model..

Epoch 1/800
 1/70 [..............................] - ETA: 2:03 - loss: 8.5121 8/70 [==>...........................] - ETA: 0s - loss: 20.3829 14/70 [=====>........................] - ETA: 0s - loss: 13.671921/70 [========>.....................] - ETA: 0s - loss: 10.923428/70 [===========>..................] - ETA: 0s - loss: 9.2756 35/70 [==============>...............] - ETA: 0s - loss: 8.155243/70 [=================>............] - ETA: 0s - loss: 7.279151/70 [====================>.........] - ETA: 0s - loss: 6.657659/70 [========================>.....] - ETA: 0s - loss: 6.177467/70 [===========================>..] - ETA: 0s - loss: 5.796470/70 [==============================] - 3s 13ms/step - loss: 5.6516 - val_loss: 2.5696
Epoch 2/800
 1/70 [..............................] - ETA: 0s - loss: 1.8686 6/70 [=>............................] - ETA: 0s - loss: 2.413710/70 [===>..........................] - ETA: 0s - loss: 2.593816/70 [=====>........................] - ETA: 0s - loss: 2.524121/70 [========>.....................] - ETA: 0s - loss: 2.367126/70 [==========>...................] - ETA: 0s - loss: 2.241330/70 [===========>..................] - ETA: 0s - loss: 2.135635/70 [==============>...............] - ETA: 0s - loss: 2.058340/70 [================>.............] - ETA: 0s - loss: 1.931845/70 [==================>...........] - ETA: 0s - loss: 1.867550/70 [====================>.........] - ETA: 0s - loss: 1.836756/70 [=======================>......] - ETA: 0s - loss: 1.785063/70 [==========================>...] - ETA: 0s - loss: 1.719270/70 [==============================] - ETA: 0s - loss: 1.673270/70 [==============================] - 1s 11ms/step - loss: 1.6732 - val_loss: 1.4652
Epoch 3/800
 1/70 [..............................] - ETA: 0s - loss: 1.6719 9/70 [==>...........................] - ETA: 0s - loss: 1.199916/70 [=====>........................] - ETA: 0s - loss: 1.123824/70 [=========>....................] - ETA: 0s - loss: 1.009931/70 [============>.................] - ETA: 0s - loss: 0.955139/70 [===============>..............] - ETA: 0s - loss: 0.908047/70 [===================>..........] - ETA: 0s - loss: 0.878455/70 [======================>.......] - ETA: 0s - loss: 0.848863/70 [==========================>...] - ETA: 0s - loss: 0.821670/70 [==============================] - 1s 8ms/step - loss: 0.7918 - val_loss: 0.5410
Epoch 4/800
 1/70 [..............................] - ETA: 0s - loss: 0.6627 9/70 [==>...........................] - ETA: 0s - loss: 0.481717/70 [======>.......................] - ETA: 0s - loss: 0.489825/70 [=========>....................] - ETA: 0s - loss: 0.461633/70 [=============>................] - ETA: 0s - loss: 0.458141/70 [================>.............] - ETA: 0s - loss: 0.471049/70 [====================>.........] - ETA: 0s - loss: 0.472156/70 [=======================>......] - ETA: 0s - loss: 0.475264/70 [==========================>...] - ETA: 0s - loss: 0.470070/70 [==============================] - 1s 8ms/step - loss: 0.4676 - val_loss: 0.5332
Epoch 5/800
 1/70 [..............................] - ETA: 0s - loss: 0.3651 9/70 [==>...........................] - ETA: 0s - loss: 0.438717/70 [======>.......................] - ETA: 0s - loss: 0.429225/70 [=========>....................] - ETA: 0s - loss: 0.462233/70 [=============>................] - ETA: 0s - loss: 0.484041/70 [================>.............] - ETA: 0s - loss: 0.491049/70 [====================>.........] - ETA: 0s - loss: 0.474157/70 [=======================>......] - ETA: 0s - loss: 0.481165/70 [==========================>...] - ETA: 0s - loss: 0.480970/70 [==============================] - 1s 8ms/step - loss: 0.4687 - val_loss: 0.6457
Epoch 6/800
 1/70 [..............................] - ETA: 0s - loss: 0.3098 9/70 [==>...........................] - ETA: 0s - loss: 0.354317/70 [======>.......................] - ETA: 0s - loss: 0.367825/70 [=========>....................] - ETA: 0s - loss: 0.349633/70 [=============>................] - ETA: 0s - loss: 0.336941/70 [================>.............] - ETA: 0s - loss: 0.335149/70 [====================>.........] - ETA: 0s - loss: 0.333957/70 [=======================>......] - ETA: 0s - loss: 0.324165/70 [==========================>...] - ETA: 0s - loss: 0.325570/70 [==============================] - 1s 8ms/step - loss: 0.3194 - val_loss: 0.3662
Epoch 7/800
 1/70 [..............................] - ETA: 0s - loss: 0.3389 9/70 [==>...........................] - ETA: 0s - loss: 0.266717/70 [======>.......................] - ETA: 0s - loss: 0.256725/70 [=========>....................] - ETA: 0s - loss: 0.281433/70 [=============>................] - ETA: 0s - loss: 0.281941/70 [================>.............] - ETA: 0s - loss: 0.290649/70 [====================>.........] - ETA: 0s - loss: 0.302757/70 [=======================>......] - ETA: 0s - loss: 0.303065/70 [==========================>...] - ETA: 0s - loss: 0.295170/70 [==============================] - 1s 8ms/step - loss: 0.2913 - val_loss: 0.3341
Epoch 8/800
 1/70 [..............................] - ETA: 0s - loss: 0.2544 9/70 [==>...........................] - ETA: 0s - loss: 0.274816/70 [=====>........................] - ETA: 0s - loss: 0.312524/70 [=========>....................] - ETA: 0s - loss: 0.288030/70 [===========>..................] - ETA: 0s - loss: 0.280938/70 [===============>..............] - ETA: 0s - loss: 0.291646/70 [==================>...........] - ETA: 0s - loss: 0.291954/70 [======================>.......] - ETA: 0s - loss: 0.282861/70 [=========================>....] - ETA: 0s - loss: 0.292269/70 [============================>.] - ETA: 0s - loss: 0.306670/70 [==============================] - 1s 8ms/step - loss: 0.3073 - val_loss: 1.0860
Epoch 9/800
 1/70 [..............................] - ETA: 0s - loss: 0.9287 9/70 [==>...........................] - ETA: 0s - loss: 0.592417/70 [======>.......................] - ETA: 0s - loss: 0.529625/70 [=========>....................] - ETA: 0s - loss: 0.471133/70 [=============>................] - ETA: 0s - loss: 0.420941/70 [================>.............] - ETA: 0s - loss: 0.373249/70 [====================>.........] - ETA: 0s - loss: 0.334157/70 [=======================>......] - ETA: 0s - loss: 0.311365/70 [==========================>...] - ETA: 0s - loss: 0.295770/70 [==============================] - 1s 8ms/step - loss: 0.2873 - val_loss: 0.2309
Epoch 10/800
 1/70 [..............................] - ETA: 0s - loss: 0.1631 9/70 [==>...........................] - ETA: 0s - loss: 0.183517/70 [======>.......................] - ETA: 0s - loss: 0.170424/70 [=========>....................] - ETA: 0s - loss: 0.176632/70 [============>.................] - ETA: 0s - loss: 0.173740/70 [================>.............] - ETA: 0s - loss: 0.167248/70 [===================>..........] - ETA: 0s - loss: 0.159156/70 [=======================>......] - ETA: 0s - loss: 0.160964/70 [==========================>...] - ETA: 0s - loss: 0.158570/70 [==============================] - 1s 8ms/step - loss: 0.1566 - val_loss: 0.2275
Epoch 11/800
 1/70 [..............................] - ETA: 0s - loss: 0.1354 9/70 [==>...........................] - ETA: 0s - loss: 0.140017/70 [======>.......................] - ETA: 0s - loss: 0.128725/70 [=========>....................] - ETA: 0s - loss: 0.124433/70 [=============>................] - ETA: 0s - loss: 0.131140/70 [================>.............] - ETA: 0s - loss: 0.131247/70 [===================>..........] - ETA: 0s - loss: 0.133755/70 [======================>.......] - ETA: 0s - loss: 0.136362/70 [=========================>....] - ETA: 0s - loss: 0.137570/70 [==============================] - ETA: 0s - loss: 0.136870/70 [==============================] - 1s 8ms/step - loss: 0.1368 - val_loss: 0.1916
Epoch 12/800
 1/70 [..............................] - ETA: 0s - loss: 0.1396 9/70 [==>...........................] - ETA: 0s - loss: 0.133217/70 [======>.......................] - ETA: 0s - loss: 0.119125/70 [=========>....................] - ETA: 0s - loss: 0.115533/70 [=============>................] - ETA: 0s - loss: 0.120241/70 [================>.............] - ETA: 0s - loss: 0.122349/70 [====================>.........] - ETA: 0s - loss: 0.123457/70 [=======================>......] - ETA: 0s - loss: 0.121965/70 [==========================>...] - ETA: 0s - loss: 0.120470/70 [==============================] - 1s 8ms/step - loss: 0.1192 - val_loss: 0.1471
Epoch 13/800
 1/70 [..............................] - ETA: 0s - loss: 0.1275 9/70 [==>...........................] - ETA: 0s - loss: 0.164417/70 [======>.......................] - ETA: 0s - loss: 0.148625/70 [=========>....................] - ETA: 0s - loss: 0.144333/70 [=============>................] - ETA: 0s - loss: 0.145641/70 [================>.............] - ETA: 0s - loss: 0.137849/70 [====================>.........] - ETA: 0s - loss: 0.131257/70 [=======================>......] - ETA: 0s - loss: 0.125965/70 [==========================>...] - ETA: 0s - loss: 0.122770/70 [==============================] - 1s 8ms/step - loss: 0.1229 - val_loss: 0.1511
Epoch 14/800
 1/70 [..............................] - ETA: 0s - loss: 0.1106 9/70 [==>...........................] - ETA: 0s - loss: 0.103817/70 [======>.......................] - ETA: 0s - loss: 0.098225/70 [=========>....................] - ETA: 0s - loss: 0.093933/70 [=============>................] - ETA: 0s - loss: 0.095941/70 [================>.............] - ETA: 0s - loss: 0.092549/70 [====================>.........] - ETA: 0s - loss: 0.093957/70 [=======================>......] - ETA: 0s - loss: 0.092465/70 [==========================>...] - ETA: 0s - loss: 0.093270/70 [==============================] - 1s 8ms/step - loss: 0.0940 - val_loss: 0.1265
Epoch 15/800
 1/70 [..............................] - ETA: 0s - loss: 0.0794 9/70 [==>...........................] - ETA: 0s - loss: 0.107817/70 [======>.......................] - ETA: 0s - loss: 0.093525/70 [=========>....................] - ETA: 0s - loss: 0.101633/70 [=============>................] - ETA: 0s - loss: 0.103141/70 [================>.............] - ETA: 0s - loss: 0.104049/70 [====================>.........] - ETA: 0s - loss: 0.101657/70 [=======================>......] - ETA: 0s - loss: 0.097965/70 [==========================>...] - ETA: 0s - loss: 0.099170/70 [==============================] - 1s 8ms/step - loss: 0.0992 - val_loss: 0.1617
Epoch 16/800
 1/70 [..............................] - ETA: 0s - loss: 0.1629 9/70 [==>...........................] - ETA: 0s - loss: 0.110117/70 [======>.......................] - ETA: 0s - loss: 0.110425/70 [=========>....................] - ETA: 0s - loss: 0.102533/70 [=============>................] - ETA: 0s - loss: 0.096440/70 [================>.............] - ETA: 0s - loss: 0.094248/70 [===================>..........] - ETA: 0s - loss: 0.091256/70 [=======================>......] - ETA: 0s - loss: 0.086064/70 [==========================>...] - ETA: 0s - loss: 0.085770/70 [==============================] - 1s 8ms/step - loss: 0.0869 - val_loss: 0.1045
Epoch 17/800
 1/70 [..............................] - ETA: 0s - loss: 0.0628 9/70 [==>...........................] - ETA: 0s - loss: 0.105117/70 [======>.......................] - ETA: 0s - loss: 0.099725/70 [=========>....................] - ETA: 0s - loss: 0.094233/70 [=============>................] - ETA: 0s - loss: 0.091241/70 [================>.............] - ETA: 0s - loss: 0.091148/70 [===================>..........] - ETA: 0s - loss: 0.088356/70 [=======================>......] - ETA: 0s - loss: 0.085064/70 [==========================>...] - ETA: 0s - loss: 0.083570/70 [==============================] - 1s 8ms/step - loss: 0.0819 - val_loss: 0.0989
Epoch 18/800
 1/70 [..............................] - ETA: 0s - loss: 0.0871 9/70 [==>...........................] - ETA: 0s - loss: 0.072217/70 [======>.......................] - ETA: 0s - loss: 0.065325/70 [=========>....................] - ETA: 0s - loss: 0.062933/70 [=============>................] - ETA: 0s - loss: 0.062741/70 [================>.............] - ETA: 0s - loss: 0.072649/70 [====================>.........] - ETA: 0s - loss: 0.088657/70 [=======================>......] - ETA: 0s - loss: 0.095865/70 [==========================>...] - ETA: 0s - loss: 0.094970/70 [==============================] - 1s 8ms/step - loss: 0.0972 - val_loss: 0.1291
Epoch 19/800
 1/70 [..............................] - ETA: 0s - loss: 0.0810 9/70 [==>...........................] - ETA: 0s - loss: 0.083817/70 [======>.......................] - ETA: 0s - loss: 0.086225/70 [=========>....................] - ETA: 0s - loss: 0.083233/70 [=============>................] - ETA: 0s - loss: 0.082541/70 [================>.............] - ETA: 0s - loss: 0.077349/70 [====================>.........] - ETA: 0s - loss: 0.075757/70 [=======================>......] - ETA: 0s - loss: 0.076464/70 [==========================>...] - ETA: 0s - loss: 0.079970/70 [==============================] - 1s 8ms/step - loss: 0.0872 - val_loss: 0.2261
Epoch 20/800
 1/70 [..............................] - ETA: 0s - loss: 0.1725 9/70 [==>...........................] - ETA: 0s - loss: 0.145217/70 [======>.......................] - ETA: 0s - loss: 0.125725/70 [=========>....................] - ETA: 0s - loss: 0.110133/70 [=============>................] - ETA: 0s - loss: 0.100341/70 [================>.............] - ETA: 0s - loss: 0.091849/70 [====================>.........] - ETA: 0s - loss: 0.085457/70 [=======================>......] - ETA: 0s - loss: 0.081365/70 [==========================>...] - ETA: 0s - loss: 0.078570/70 [==============================] - 1s 8ms/step - loss: 0.0784 - val_loss: 0.1127
Epoch 21/800
 1/70 [..............................] - ETA: 0s - loss: 0.0957 9/70 [==>...........................] - ETA: 0s - loss: 0.083017/70 [======>.......................] - ETA: 0s - loss: 0.098025/70 [=========>....................] - ETA: 0s - loss: 0.100533/70 [=============>................] - ETA: 0s - loss: 0.094641/70 [================>.............] - ETA: 0s - loss: 0.090149/70 [====================>.........] - ETA: 0s - loss: 0.085157/70 [=======================>......] - ETA: 0s - loss: 0.080365/70 [==========================>...] - ETA: 0s - loss: 0.075870/70 [==============================] - 1s 8ms/step - loss: 0.0749 - val_loss: 0.0928
Epoch 22/800
 1/70 [..............................] - ETA: 0s - loss: 0.0731 9/70 [==>...........................] - ETA: 0s - loss: 0.072017/70 [======>.......................] - ETA: 0s - loss: 0.065425/70 [=========>....................] - ETA: 0s - loss: 0.057333/70 [=============>................] - ETA: 0s - loss: 0.053641/70 [================>.............] - ETA: 0s - loss: 0.054048/70 [===================>..........] - ETA: 0s - loss: 0.057856/70 [=======================>......] - ETA: 0s - loss: 0.056364/70 [==========================>...] - ETA: 0s - loss: 0.057570/70 [==============================] - 1s 8ms/step - loss: 0.0595 - val_loss: 0.1015
Epoch 23/800
 1/70 [..............................] - ETA: 0s - loss: 0.0706 8/70 [==>...........................] - ETA: 0s - loss: 0.066016/70 [=====>........................] - ETA: 0s - loss: 0.063724/70 [=========>....................] - ETA: 0s - loss: 0.055332/70 [============>.................] - ETA: 0s - loss: 0.052640/70 [================>.............] - ETA: 0s - loss: 0.052648/70 [===================>..........] - ETA: 0s - loss: 0.052556/70 [=======================>......] - ETA: 0s - loss: 0.052164/70 [==========================>...] - ETA: 0s - loss: 0.052470/70 [==============================] - 1s 8ms/step - loss: 0.0523 - val_loss: 0.0699
Epoch 24/800
 1/70 [..............................] - ETA: 0s - loss: 0.0206 7/70 [==>...........................] - ETA: 0s - loss: 0.046313/70 [====>.........................] - ETA: 0s - loss: 0.045019/70 [=======>......................] - ETA: 0s - loss: 0.045126/70 [==========>...................] - ETA: 0s - loss: 0.046132/70 [============>.................] - ETA: 0s - loss: 0.046739/70 [===============>..............] - ETA: 0s - loss: 0.047045/70 [==================>...........] - ETA: 0s - loss: 0.046352/70 [=====================>........] - ETA: 0s - loss: 0.047658/70 [=======================>......] - ETA: 0s - loss: 0.046865/70 [==========================>...] - ETA: 0s - loss: 0.045670/70 [==============================] - 1s 10ms/step - loss: 0.0454 - val_loss: 0.0598
Epoch 25/800
 1/70 [..............................] - ETA: 0s - loss: 0.0452 9/70 [==>...........................] - ETA: 0s - loss: 0.044017/70 [======>.......................] - ETA: 0s - loss: 0.040625/70 [=========>....................] - ETA: 0s - loss: 0.042433/70 [=============>................] - ETA: 0s - loss: 0.044741/70 [================>.............] - ETA: 0s - loss: 0.044849/70 [====================>.........] - ETA: 0s - loss: 0.044857/70 [=======================>......] - ETA: 0s - loss: 0.047265/70 [==========================>...] - ETA: 0s - loss: 0.046470/70 [==============================] - 1s 8ms/step - loss: 0.0463 - val_loss: 0.0760
Epoch 26/800
 1/70 [..............................] - ETA: 0s - loss: 0.0470 9/70 [==>...........................] - ETA: 0s - loss: 0.040717/70 [======>.......................] - ETA: 0s - loss: 0.043825/70 [=========>....................] - ETA: 0s - loss: 0.041333/70 [=============>................] - ETA: 0s - loss: 0.044641/70 [================>.............] - ETA: 0s - loss: 0.047549/70 [====================>.........] - ETA: 0s - loss: 0.047756/70 [=======================>......] - ETA: 0s - loss: 0.048464/70 [==========================>...] - ETA: 0s - loss: 0.049470/70 [==============================] - 1s 8ms/step - loss: 0.0501 - val_loss: 0.0856
Epoch 27/800
 1/70 [..............................] - ETA: 0s - loss: 0.0769 9/70 [==>...........................] - ETA: 0s - loss: 0.090017/70 [======>.......................] - ETA: 0s - loss: 0.082025/70 [=========>....................] - ETA: 0s - loss: 0.076433/70 [=============>................] - ETA: 0s - loss: 0.072640/70 [================>.............] - ETA: 0s - loss: 0.069948/70 [===================>..........] - ETA: 0s - loss: 0.068856/70 [=======================>......] - ETA: 0s - loss: 0.065063/70 [==========================>...] - ETA: 0s - loss: 0.063370/70 [==============================] - 1s 8ms/step - loss: 0.0614 - val_loss: 0.0601
Epoch 28/800
 1/70 [..............................] - ETA: 0s - loss: 0.0536 9/70 [==>...........................] - ETA: 0s - loss: 0.041917/70 [======>.......................] - ETA: 0s - loss: 0.040925/70 [=========>....................] - ETA: 0s - loss: 0.040733/70 [=============>................] - ETA: 0s - loss: 0.040741/70 [================>.............] - ETA: 0s - loss: 0.044049/70 [====================>.........] - ETA: 0s - loss: 0.044056/70 [=======================>......] - ETA: 0s - loss: 0.042964/70 [==========================>...] - ETA: 0s - loss: 0.042170/70 [==============================] - 1s 8ms/step - loss: 0.0420 - val_loss: 0.0603
Epoch 29/800
 1/70 [..............................] - ETA: 0s - loss: 0.0342 9/70 [==>...........................] - ETA: 0s - loss: 0.039617/70 [======>.......................] - ETA: 0s - loss: 0.036725/70 [=========>....................] - ETA: 0s - loss: 0.036433/70 [=============>................] - ETA: 0s - loss: 0.035641/70 [================>.............] - ETA: 0s - loss: 0.034849/70 [====================>.........] - ETA: 0s - loss: 0.035157/70 [=======================>......] - ETA: 0s - loss: 0.036465/70 [==========================>...] - ETA: 0s - loss: 0.037670/70 [==============================] - 1s 8ms/step - loss: 0.0383 - val_loss: 0.0556
Epoch 30/800
 1/70 [..............................] - ETA: 0s - loss: 0.0227 9/70 [==>...........................] - ETA: 0s - loss: 0.031317/70 [======>.......................] - ETA: 0s - loss: 0.030925/70 [=========>....................] - ETA: 0s - loss: 0.032933/70 [=============>................] - ETA: 0s - loss: 0.032841/70 [================>.............] - ETA: 0s - loss: 0.034349/70 [====================>.........] - ETA: 0s - loss: 0.034957/70 [=======================>......] - ETA: 0s - loss: 0.036065/70 [==========================>...] - ETA: 0s - loss: 0.035770/70 [==============================] - 1s 8ms/step - loss: 0.0360 - val_loss: 0.0529
Epoch 31/800
 1/70 [..............................] - ETA: 0s - loss: 0.0242 9/70 [==>...........................] - ETA: 0s - loss: 0.029217/70 [======>.......................] - ETA: 0s - loss: 0.034924/70 [=========>....................] - ETA: 0s - loss: 0.036331/70 [============>.................] - ETA: 0s - loss: 0.034838/70 [===============>..............] - ETA: 0s - loss: 0.034246/70 [==================>...........] - ETA: 0s - loss: 0.033354/70 [======================>.......] - ETA: 0s - loss: 0.032962/70 [=========================>....] - ETA: 0s - loss: 0.032570/70 [==============================] - ETA: 0s - loss: 0.032470/70 [==============================] - 1s 8ms/step - loss: 0.0324 - val_loss: 0.0503
Epoch 32/800
 1/70 [..............................] - ETA: 0s - loss: 0.0143 9/70 [==>...........................] - ETA: 0s - loss: 0.035416/70 [=====>........................] - ETA: 0s - loss: 0.0388